app/controllers/anexos_controller.rb

SELECT "anexos".* FROM "anexos" ORDER BY "anexos"."id" DESC
---
def index
  @anexos = Anexo.order(id: :desc)