app/controllers/arquivos_controller.rb

  def create
    @arquivo = current_user.arquivos.build(arquivo_params)
    if @arquivo.save
---
INSERT INTO "arquivos" ("titulo", "autor", "ano", "licenca", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)  [["titulo", "Titulo"], ["autor", "Autor"], ["ano", "Ano"], ["licenca", "Licenca"], ["created_at", "2019-05-25 03:18:35.680158"], ["updated_at", "2019-05-25 03:18:35.680158"], ["user_id", 4]]

  def edit
    @arquivo = current_user.arquivos.find_by(id: params[:id])
---
SELECT  "arquivos".* FROM "arquivos" WHERE "arquivos"."user_id" = ? AND "arquivos"."id" = ? LIMIT ?  [["user_id", 4], ["id", 4], ["LIMIT", 1]]

  def update
    @arquivo = current_user.arquivos.find(params[:id])
    if @arquivo.update(arquivo_params)
---
SELECT  "arquivos".* FROM "arquivos" WHERE "arquivos"."user_id" = ? AND "arquivos"."id" = ? LIMIT ?  [["user_id", 4], ["id", 4], ["LIMIT", 1]]
UPDATE "arquivos" SET "titulo" = ?, "updated_at" = ? WHERE "arquivos"."id" = ?  [["titulo", "Altera"], ["updated_at", "2019-05-25 03:25:44.123785"], ["id", 4]]

  def destroy
    @arquivo = current_user.arquivos.find(params[:id])
    if @arquivo.destroy
---
SELECT  "arquivos".* FROM "arquivos" WHERE "arquivos"."user_id" = ? AND "arquivos"."id" = ? LIMIT ?  [["user_id", 4], ["id", 1], ["LIMIT", 1]]
DELETE FROM "arquivos" WHERE "arquivos"."id" = ?  [["id", 2]]